app/views/checkouts/show.html.erb

  <strong>Accessory:</strong>
  <% @checkout.bike.accessories.each do |accessory| %>
---
SELECT  "accessories".* FROM "accessories"  WHERE "accessories"."bike_id" = $1  ORDER BY "accessories"."id" ASC LIMIT 1  [["bike_id", 1]]
SELECT  "bikes".* FROM "bikes"  WHERE "bikes"."id" = $1 LIMIT 1  [["id", 1]]