app/controllers/accessories_controller.rb

  def index
    @accessories = Accessory.all
---
SELECT "accessories".* FROM "accessories"

  def create
    @accessory = Accessory.new(accessory_params)

    respond_to do |format|
      if @accessory.save
---
INSERT INTO "accessories" ("created_at", "name", "not_missing", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-07-09 20:39:37.239425"], ["name", "sddsda"], ["not_missing", "t"], ["updated_at", "2014-07-09 20:39:37.239425"]]

  def update
    respond_to do |format|
      if @accessory.update(accessory_params)
---
UPDATE "accessories" SET "not_missing" = $1, "updated_at" = $2 WHERE "accessories"."id" = 1  [["not_missing", "f"], ["updated_at", "2014-07-17 22:31:22.153213"]]

    def set_accessory
      @accessory = Accessory.find(params[:id])
---
SELECT  "accessories".* FROM "accessories"  WHERE "accessories"."id" = $1 LIMIT 1  [["id", 2]]