app/controllers/bikes_controller.rb

SELECT "bikes".* FROM "bikes"
---
  def index
    @bikes = Bike.all

INSERT INTO "bikes" ("created_at", "lock_password", "name", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["created_at", "2014-07-08 21:11:02.489101"], ["lock_password", "PASSWORD"], ["name", "Green Hornet"], ["updated_at", "2014-07-08 21:11:02.489101"]]
---
  def create
    @bike = Bike.new(bike_params)

    respond_to do |format|
      if @bike.save

UPDATE "bikes" SET "image_file_name" = $1, "image_updated_at" = $2, "updated_at" = $3 WHERE "bikes"."id" = 2  [["image_file_name", "Screen_Shot_2014-07-06_at_6.59.34_PM.png"], ["image_updated_at", "2014-07-09 00:06:01.939119"], ["updated_at", "2014-07-09 00:06:02.151567"]]
---
  def update
    respond_to do |format|
      if @bike.update(bike_params)

SELECT  "bikes".* FROM "bikes"  WHERE "bikes"."id" = $1 LIMIT 1  [["id", 2]]
---
    def set_bike
      @bike = Bike.find(params[:id])