app/controllers/checkouts_controller.rb

  def index
    @checkouts = Checkout.all.includes(:user).includes(:bike)
---
SELECT "bikes".* FROM "bikes"  WHERE "bikes"."id" IN (1)
SELECT "checkouts".* FROM "checkouts"
SELECT "users".* FROM "users"  WHERE "users"."id" IN (1)

  def create
    @checkout = Checkout.new(checkout_params)

    respond_to do |format|
      if @checkout.save
---
INSERT INTO "checkouts" ("bike_id", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4) RETURNING "id"  [["bike_id", 1], ["created_at", "2014-07-08 23:24:51.984081"], ["updated_at", "2014-07-08 23:24:51.984081"], ["user_id", 4]]

  def update
    respond_to do |format|
      if @checkout.update(checkout_params)
---
UPDATE "checkouts" SET "returned_at" = $1, "updated_at" = $2 WHERE "checkouts"."id" = 1  [["returned_at", "2014-07-09 20:17:32.000000"], ["updated_at", "2014-07-09 20:17:35.750048"]]

  def destroy
    @checkout.destroy
---
DELETE FROM "checkouts" WHERE "checkouts"."id" = $1  [["id", 1]]

    def set_checkout
      @checkout = Checkout.find(params[:id])
---
SELECT  "checkouts".* FROM "checkouts"  WHERE "checkouts"."id" = $1 LIMIT 1  [["id", 1]]