app/controllers/sessions_controller.rb

	def create
		auth = request.env["omniauth.auth"]
		user = User.find_by(provider: auth["provider"], uid: auth["uid"]) || User.create_with_omniauth(auth)
---
INSERT INTO "users" ("admin", "created_at", "email", "picture", "provider", "uid", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
SELECT  "users".* FROM "users"  WHERE "users"."provider" = 'cobot' AND "users"."uid" = 'c5787a5c285ad5fc4d0ae7b6d6e14be0' LIMIT 1