app/controllers/sessions_controller.rb

	def login_attempt
		user = User.find_by(username: params[:username]).try(:authenticate, params[:login_password])
---
SELECT  "users".* FROM "users"  WHERE "users"."username" = 'rff' LIMIT 1